const Mock = require("mockjs");
const dk_kb = Mock.mock({
  // "list|1": [
  //   {
  //     id: "@id",
  //     dndkbs: "@integer(5000,12000)",
  //     dydkbs: "@integer(0,1000)",
  //     ljdkbs: "@integer(30000,100000)",
  //     cldkbs: "@integer(30000,100000)",
  //     dndkje: "@float(5000,99999,1,1)",
  //     dydkje: "@float(100,10000,1,1)",
  //     ljdkje: "@float(50000,999999,1,1)",
  //     cldkje: "@float(50090,999999,1,1)"
  //   }
  // ]
  "retList":[
    {
      "ljdkje":2485010.80,
      "dydkbs":68,
      "cldkbs":55062,
      "dndkbs":1585,
      "ljdkbs":88518,
      "dydkje":2693.50,
      "cldkje":1302065.73,
      "dndkje":63283.00
    }
  ]
});
const dk_hkzsfx = Mock.mock({
  // "list|12": [
  //   {
  //     id: "@id",
  //     "ny|+1": [
  //       "2022年4月",
  //       "2022年5月",
  //       "2022年6月",
  //       "2022年7月",
  //       "2022年8月",
  //       "2022年9月",
  //       "2022年10月",
  //       "2022年11月",
  //       "2022年12月",
  //       "2023年1月",
  //       "2023年2月",
  //       "2023年3月"
  //     ],
  //     hkbs: "@integer(5000,10000)",
  //     hkje: "@float(50,100,1,1)"
  //   }
  // ]
  "retList":[
    {
      "hkbs":415,
      "ny":"2023年\n4月",
      "hkje":230
    },
    {
      "hkbs":380,
      "ny":"5月",
      "hkje":290
    },
    {
      "hkbs":430,
      "ny":"6月",
      "hkje":312
    },
    {
      "hkbs":350,
      "ny":"7月",
      "hkje":260
    },
    {
      "hkbs":465,
      "ny":"8月",
      "hkje":365
    },
    {
      "hkbs":390,
      "ny":"9月",
      "hkje":390
    },
    {
      "hkbs":375,
      "ny":"10月",
      "hkje":285
    },
    {
      "hkbs":399,
      "ny":"11月",
      "hkje":365
    },
    {
      "hkbs":350,
      "ny":"12月",
      "hkje":265
    },
    {
      "hkbs":362,
      "ny":"2023年\n1月",
      "hkje":266
    },
    {
      "hkbs":405,
      "ny":"2月",
      "hkje":300
    },
    {
      "hkbs":315,
      "ny":"3月",
      "hkje":285
    }
  ]
});
const dk_gfmj = Mock.mock({
  // "list|3": [
  //   {
  //     id: "@id",
  //     "lx|+1": ["144㎡以上", "90-144㎡", "90㎡以下"],
  //     ts: "@integer(100,3000)"
  //   }
  // ]
  "retList":[
    {
      "lx":"144m²以上",
      "ts":453
    },
    {
      "lx":"90-144m²",
      "ts":2345
    },
    {
      "lx":"90m²以下",
      "ts":1675
    }
  ]
});
const dk_jwnfkzsfx = Mock.mock({
  // "list|5": [
  //   {
  //     id: "@id",
  //     "year|+1": ["2019年", "2020年", "2021年", "2022年", "2023年"],
  //     bs: "@integer(1000,4000)",
  //     bsbfvb: "@float(-10,10,1,1)",
  //     je: "@integer(10000,40000)",
  //     jebfvb: "@float(-10,10,1,1)"
  //   }
  // ]
  "retList":[
    {
      "bs":1585,
      "jebfvb":-65.05,
      "year":"2024",
      "je":63283.00,
      "bsbfvb":-65.10
    },
    {
      "bs":4541,
      "jebfvb":-20.37,
      "year":"2023",
      "je":181072.50,
      "bsbfvb":-19.78
    },
    {
      "bs":5661,
      "jebfvb":-13.95,
      "year":"2022",
      "je":227387.00,
      "bsbfvb":-11.06
    },
    {
      "bs":6365,
      "jebfvb":-7.01,
      "year":"2021",
      "je":264240.50,
      "bsbfvb":-8.65
    },
    {
      "bs":6968,
      "jebfvb":14.41,
      "year":"2020",
      "je":284169.00,
      "bsbfvb":4.48
    }
  ]
});
const dk_dkyezs = Mock.mock({
  // "list|12": [
  //   {
  //     id: "@id",
  //     "ny|+1": [
  //       "2022年4月",
  //       "2022年5月",
  //       "2022年6月",
  //       "2022年7月",
  //       "2022年8月",
  //       "2022年9月",
  //       "2022年10月",
  //       "2022年11月",
  //       "2022年12月",
  //       "2023年1月",
  //       "2023年2月",
  //       "2023年3月"
  //     ],
  //     cldkbs: "@integer(0,50)",
  //     dkye: "@float(50,500,1,1)"
  //   }
  // ]
  "retList":[
    {
      "cldkbs":26,
      "ny":"2022年\n4月",
      "dkye":280
    },
    {
      "cldkbs":31,
      "ny":"5月",
      "dkye":300
    },
    {
      "cldkbs":33,
      "ny":"6月",
      "dkye":333
    },
    {
      "cldkbs":23,
      "ny":"7月",
      "dkye":260
    },
    {
      "cldkbs":38,
      "ny":"8月",
      "dkye":369
    },
    {
      "cldkbs":41,
      "ny":"9月",
      "dkye":382
    },
    {
      "cldkbs":32,
      "ny":"10月",
      "dkye":280
    },
    {
      "cldkbs":45,
      "ny":"11月",
      "dkye":350
    },
    {
      "cldkbs":32,
      "ny":"12月",
      "dkye":280
    },
    {
      "cldkbs":28,
      "ny":"2023年\n1月",
      "dkye":280
    },
    {
      "cldkbs":31,
      "ny":"2月",
      "dkye":310
    },
    {
      "cldkbs":26,
      "ny":"3月",
      "dkye":270
    }
  ]
});
const dk_dkzsfx = Mock.mock({
  // "list|5": [
  //   {
  //     id: "@id",
  //     "year|+1": ["2018年", "2019年", "2020年", "2021年", "2022年"],
  //     lx: "首次贷款笔数",
  //     sl: "@integer(50000,25000)"
  //   },
  //   {
  //     id: "@id",
  //     "year|+1": ["2018年", "2019年", "2020年", "2021年", "2022年"],
  //     lx: "二次贷款笔数",
  //     sl: "@integer(50000,25000)"
  //   },
  //   {
  //     id: "@id",
  //     "year|+1": ["2018年", "2019年", "2020年", "2021年", "2022年"],
  //     lx: "放款余额",
  //     sl: "@float(10,50,1,1)"
  //   }
  // ]

  "retList":[
    {
      "year":"2018年",
      "ecdkbs":16000,
      "fkje":1600,
        "gdl":"1.3%",
        "tbt":"+5.7%",
        "tbb":"+5.7%",
        "hbt":"+1.3%",
        "hbb":"+1.3%",

    },
    {
      "year":"2019年",
      "ecdkbs":21490,
      "fkje":2010,
        "gdl":"1.3%",
        "tbt":"+5.7%",
        "tbb":"+5.7%",
        "hbt":"+1.3%",
        "hbb":"+1.3%"
    },
    {
      "year":"2020年",
      "ecdkbs":14950,
      "fkje":2050,
        "gdl":"1.3%",
        "tbt":"+5.7%",
        "tbb":"+5.7%",
        "hbt":"+1.3%",
        "hbb":"+1.3%"
    },
    {
      "year":"2021年",
      "ecdkbs":21590,
      "fkje":2300,
        "gdl":"1.3%",
        "tbt":"+5.7%",
        "tbb":"+5.7%",
        "hbt":"+1.3%",
        "hbb":"+1.3%"
    },
    {
      "year":"2022年",
      "ecdkbs":15120,
      "fkje":2020,
        "gdl":"1.3%",
        "tbt":"+5.7%",
        "tbb":"+5.7%",
        "hbt":"+1.3%",
        "hbb":"+1.3%"
    }
  ]
});
const dk_dkyqqk = Mock.mock({
  // "list|5": [
  //   {
  //     id: "@id",
  //     "lx|+1": ["3月以下", "3-6月", "6-12月", "12-24月", "2年以上"],
  //     yqbs: "@integer(500,2000)",
  //     yqje: "@float(100,1000,1,1)"
  //   }
  // ]
  "retList":[
    {
      "yqbs":80,
      "yqje":10.97,
      "lx":"1-3月"
    },
    {
      "yqbs":3,
      "yqje":1.50,
      "lx":"3-6月"
    },
    {
      "yqbs":2,
      "yqje":2.15,
      "lx":"6-12月"
    },
    {
      "yqbs":3,
      "yqje":25.26,
      "lx":"12-24月"
    },
    {
      "yqbs":2,
      "yqje":8.02,
      "lx":"2年以上"
    }
  ]
});
const dk_awdyhfx = Mock.mock({
  // "list|4": [
  //   {
  //     id: "@id",
  //     "yhmc|+1": ["测试银行1", "测试银行2", "测试银行3", "测试银行4"],
  //     bs: "@integer(100,2000)",
  //     je: "@float(1000,10000,1,1)"
  //   }
  // ]
  "retList":[
    {
      "bs":26527,
      "je":590829.94,
      "yhmc":"建行住房城建支行"
    },
    {
      "bs":16163,
      "je":372066.81,
      "yhmc":"中行信都支行"
    },
    {
      "bs":6566,
      "je":164339.29,
      "yhmc":"农行八一路支行"
    },
    {
      "bs":5690,
      "je":170222.46,
      "yhmc":"工行邢台冶金支行"
    },
    {
      "bs":83,
      "je":3416.06,
      "yhmc":"交行邢台分行"
    },
    {
      "bs":33,
      "je":1191.17,
      "yhmc":"邢台银行襄都支行"
    }
  ]
});
const dk_dkrfx = Mock.mock({
  // "list|4": [
  //   {
  //     id: "@id",
  //     "nld|+1": ["16-30岁", "30-40岁", "40-50岁", "50岁以上"],
  //     xb: "男",
  //     bs: "@integer(100,2000)",
  //     je: "@float(1000,10000,1,1)"
  //   },
  //   {
  //     id: "@id",
  //     "nld|+1": ["16-30岁", "30-40岁", "40-50岁", "50岁以上"],
  //     xb: "女",
  //     bs: "@integer(100,2000)",
  //     je: "@float(1000,10000,1,1)"
  //   }
  // ]
  "retList":[
    {
      "bs":9468,
      "nld":"30-40岁",
      "xb":"女",
      "je":200195.61
    },
    {
      "bs":2565,
      "nld":"50岁以上",
      "xb":"男",
      "je":34854.25
    },
    {
      "bs":3127,
      "nld":"16-30岁",
      "xb":"女",
      "je":72873.55
    },
    {
      "bs":148,
      "nld":"50岁以上",
      "xb":"女",
      "je":1228.94
    },
    {
      "bs":3312,
      "nld":"40-50岁",
      "xb":"女",
      "je":50867.16
    },
    {
      "bs":11520,
      "nld":"40-50岁",
      "xb":"男",
      "je":250219.60
    },
    {
      "bs":18045,
      "nld":"30-40岁",
      "xb":"男",
      "je":515496.28
    },
    {
      "bs":6877,
      "nld":"16-30岁",
      "xb":"男",
      "je":176330.34
    }
  ]
});
const dk_dklxfx = Mock.mock({
  // "list|3": [
  //   {
  //     id: "@id",
  //     "lx|+1": ["公积金贷", "组合贷", "贴息贷"],
  //     bs: "@integer(10000,20000)",
  //     je: "@float(1000,10000,1,1)"
  //   }
  // ]
  "retList":[
    {
      "bs":566,
      "je":19991.42,
      "lx":"组合贷"
    },
    {
      "bs":1347,
      "je":19943.72,
      "lx":"商转公"
    },
    {
      "bs":53149,
      "je":1262130.59,
      "lx":"公积金贷"
    }
  ]
});

const dk_dkcsfx = Mock.mock({
    // "list|6": [
    //   {
    //     id: "@id",
    //     "lx|+1": ["1年以下", "1~2年", "2~3年", "3~5年", "5~10年", "10年以上"],
    //     xb: "男",
    //     rs: "@integer(500,1250)"
    //   },
    //   {
    //     id: "@id",
    //     "lx|+1": ["1年以下", "1~2年", "2~3年", "3~5年", "5~10年", "10年以上"],
    //     xb: "女",
    //     rs: "@integer(500,1250)"
    //   }
    // ]
    "retList":[
        {
            "srs":1800,
            "xb":"1",
            "lx":"2019年",
            "stftb":"+5.7%",
            "stfhb":"+5.7%",
        },
        {
            "ers":450,
            "xb":"2",
            "lx":"2019年",
            "etftb":"+5.7%",
            "etfhb":"+5.7%",
        },
        {
            "srs":2050,
            "xb":"1",
            "lx":"2020年",
            "stftb":"+5.7%",
            "stfhb":"+5.7%",
        },
        {
            "ers":600,
            "xb":"2",
            "lx":"2020年",
            "etftb":"+5.7%",
            "etfhb":"+5.7%",
        },
        {
            "srs":1800,
            "xb":"1",
            "lx":"2021年",
            "stftb":"+5.7%",
            "stfhb":"+5.7%",
        },
        {
            "ers":650,
            "xb":"2",
            "lx":"2021年",
            "etftb":"+5.7%",
            "etfhb":"+5.7%",
        },
        {
            "srs":1600,
            "xb":"1",
            "lx":"2022年",
            "stftb":"+5.7%",
            "stfhb":"+5.7%",
        },
        {
            "ers":590,
            "xb":"2",
            "lx":"2022年",
            "etftb":"+5.7%",
            "etfhb":"+5.7%",
        },
        {
            "srs":1500,
            "xb":"1",
            "lx":"2023年",
            "stftb":"+2.7%",
            "stfhb":"+3.7%",
        },
        {
            "ers":510,
            "xb":"2",
            "lx":"2023年",
            "etftb":"+1.7%",
            "etfhb":"+6.7%",
        },
    ]
});


module.exports = [
  {
    id: "dk_kb",
    value: dk_kb
  },
  {
    id: "dk_jwnfkzsfx",
    value: dk_jwnfkzsfx
  },
  {
    id: "dk_gfmj",
    value: dk_gfmj
  },
  {
    id: "dk_hkzsfx",
    value: dk_hkzsfx
  },
  {
    id: "dk_dkyezs",
    value: dk_dkyezs
  },
  {
    id: "dk_dkzsfx",
    value: dk_dkzsfx
  },
    {
        id: "dk_dkcsfx",
        value: dk_dkcsfx
    },
  {
    id: "dk_dkyqqk",
    value: dk_dkyqqk
  },
  {
    id: "dk_awdyhfx",
    value: dk_awdyhfx
  },
  {
    id: "dk_dkrfx",
    value: dk_dkrfx
  },
  {
    id: "dk_dklxfx",
    value: dk_dklxfx
  }
];
