const Mock = require("mockjs");

const areaList = [
  "襄都区",
  "信都区",
  "任泽区",
  "南和区",
  "临城县",
  "内丘县",
  "柏乡县",
  "隆尧县",
  "宁晋县",
  "巨鹿县",
  "新河县",
  "广宗县",
  "平乡县",
  "威县",
  "清河县",
  "临西县",
  "南宫市",
  "沙河市"
];
const jc_kb = Mock.mock({
  // "list|1": [
  //   {
  //     sjdw: "@integer(100,10000)",
  //     sjdwtb: "@float(-20,20,1,1)",
  //     sjrs: "@integer(1000,100000)",
  //     sjrstb: "@float(-20,20,1,1)"
  //   }
  // ]
  "retList":[
    {
      "sntqsjrs":325986,
      "sntqsjdws":4338,
      "sjdwtb":3.20,
      "sjrs":321097,
      "sjrstb":-1.50,
      "sjdw":4477
    }
  ]
});
const jc_sjzhzsfx = Mock.mock({
  // "list|12": [
  //   {
  //     "ny|+1": [
  //       "2022年4月",
  //       "2022年5月",
  //       "2022年6月",
  //       "2022年7月",
  //       "2022年8月",
  //       "2022年9月",
  //       "2022年10月",
  //       "2022年11月",
  //       "2022年12月",
  //       "2023年1月",
  //       "2023年2月",
  //       "2023年3月"
  //     ],
  //     jcrs: "@float(0,25,1,0)",
  //     jcje: "@float(50,250,1,0)"
  //   }
  // ]
  "retList":[
    {
      "jcje":110,
      "ny":"2022年1月",
      "jcrs":14
    },
    {
      "jcje":130,
      "ny":"2月",
      "jcrs":13
    },
    {
      "jcje":125,
      "ny":"3月",
      "jcrs":12
    },
    {
      "jcje":155,
      "ny":"4月",
      "jcrs":16
    },
    {
      "jcje":155,
      "ny":"5月",
      "jcrs":16.5
    },
    {
      "jcje":135,
      "ny":"6月",
      "jcrs":13
    },
    {
      "jcje":115,
      "ny":"7月",
      "jcrs":12
    },
    {
      "jcje":146,
      "ny":"8月",
      "jcrs":15
    },
    {
      "jcje":138,
      "ny":"9月",
      "jcrs":14
    },
    {
      "jcje":138,
      "ny":"10月",
      "jcrs":14.5
    },
    {
      "jcje":140,
      "ny":"11月",
      "jcrs":14.2
    },
    {
      "jcje":135,
      "ny":"12月",
      "jcrs":12
    }
  ]
});
const jc_jcjsfx = Mock.mock({
  // "list|10": [
  //   {
  //     "year|+1": [
  //       "2013年",
  //       "2014年",
  //       "2015年",
  //       "2016年",
  //       "2017年",
  //       "2018年",
  //       "2019年",
  //       "2020年",
  //       "2021年",
  //       "2022年"
  //     ],
  //     jcjs: "@integer(2000,4000)"
  //   }
  // ]
  "retList":[
    {
      "jcjs":4120.81,
      "year":"2016"
    },
    {
      "jcjs":4509.22,
      "year":"2017"
    },
    {
      "jcjs":4613.93,
      "year":"2018"
    },
    {
      "jcjs":4771.60,
      "year":"2019"
    },
    {
      "jcjs":5031.08,
      "year":"2020"
    },
    {
      "jcjs":5168.37,
      "year":"2021"
    },
    {
      "jcjs":5583.97,
      "year":"2022"
    },
    {
      "jcjs":6064.13,
      "year":"2023"
    }
  ]
});
const nxList = ["2年以下", "2-5年", "5-10年", "10-20年", "20-30年", "30年以上"],
  xbList = ["男", "女"],
  srdjList = ["高收入", "中收入", "低收入"];
const jc_jcrqfxList = [];
nxList.forEach((item, index) => {
  for (let i = 0; i < 6; i++) {
    jc_jcrqfxList.push({
      xb: xbList[i % 2],
      srdj: srdjList[i % 3],
      nx: item,
      rs: "@integer(1000,10000)"
    });
  }
});

const jc_jcrqfx = Mock.mock({
  // list: jc_jcrqfxList
  "retList":[
    {
      "srdj":"中低收入",
      "rs":103350,
      "xb":"女",
      "nx":"2年以下"
    },
    {
      "srdj":"高收入",
      "rs":41,
      "xb":"女",
      "nx":"2年以下"
    },
    {
      "srdj":"中低收入",
      "rs":60673,
      "xb":"女",
      "nx":"2-5年"
    },
    {
      "srdj":"高收入",
      "rs":28,
      "xb":"女",
      "nx":"2-5年"
    },
    {
      "srdj":"中低收入",
      "rs":55796,
      "xb":"女",
      "nx":"5-10年"
    },
    {
      "srdj":"高收入",
      "rs":126,
      "xb":"女",
      "nx":"5-10年"
    },
    {
      "srdj":"中低收入",
      "rs":75652,
      "xb":"女",
      "nx":"10-20年"
    },
    {
      "srdj":"高收入",
      "rs":536,
      "xb":"女",
      "nx":"10-20年"
    },
    {
      "srdj":"中低收入",
      "rs":6961,
      "xb":"女",
      "nx":"20-30年"
    },
    {
      "srdj":"高收入",
      "rs":193,
      "xb":"女",
      "nx":"20-30年"
    },
    {
      "srdj":"中低收入",
      "rs":2,
      "xb":"女",
      "nx":"30年以上"
    },
    {
      "srdj":"中低收入",
      "rs":159801,
      "xb":"男",
      "nx":"2年以下"
    },
    {
      "srdj":"高收入",
      "rs":120,
      "xb":"男",
      "nx":"2年以下"
    },
    {
      "srdj":"中低收入",
      "rs":81473,
      "xb":"男",
      "nx":"2-5年"
    },
    {
      "srdj":"高收入",
      "rs":145,
      "xb":"男",
      "nx":"2-5年"
    },
    {
      "srdj":"中低收入",
      "rs":74366,
      "xb":"男",
      "nx":"5-10年"
    },
    {
      "srdj":"高收入",
      "rs":293,
      "xb":"男",
      "nx":"5-10年"
    },
    {
      "srdj":"中低收入",
      "rs":98869,
      "xb":"男",
      "nx":"10-20年"
    },
    {
      "srdj":"高收入",
      "rs":1463,
      "xb":"男",
      "nx":"10-20年"
    },
    {
      "srdj":"中低收入",
      "rs":12083,
      "xb":"男",
      "nx":"20-30年"
    },
    {
      "srdj":"高收入",
      "rs":954,
      "xb":"男",
      "nx":"20-30年"
    },
    {
      "srdj":"中低收入",
      "rs":1,
      "xb":"男",
      "nx":"30年以上"
    }
  ]
});
const jc_sjzhglfx = Mock.mock({
  // "list|18": [
  //   {
  //     "id|+1": 0,
  //     qx: function() {
  //       return areaList[this.id % 18];
  //     },
  //     sjrs: "@float(0,10,1,1)",
  //     sjje: "@float(10,30,1,1)"
  //   }
  // ]
  "retList":[
    {
      "qx":"临城",
      "sjje":770.08,
      "sjrs":0.72
    },
    {
      "qx":"临西",
      "sjje":975.12,
      "sjrs":0.92
    },
    {
      "qx":"任泽区",
      "sjje":1353.37,
      "sjrs":1.06
    },
    {
      "qx":"信都区",
      "sjje":8311.51,
      "sjrs":5.90
    },
    {
      "qx":"内丘",
      "sjje":1006.73,
      "sjrs":0.94
    },
    {
      "qx":"南和区",
      "sjje":1063.33,
      "sjrs":0.84
    },
    {
      "qx":"南宫",
      "sjje":1164.31,
      "sjrs":1.20
    },
    {
      "qx":"威县",
      "sjje":1602.69,
      "sjrs":1.52
    },
    {
      "qx":"宁晋",
      "sjje":2505.26,
      "sjrs":2.56
    },
    {
      "qx":"巨鹿",
      "sjje":924.16,
      "sjrs":0.86
    },
    {
      "qx":"市直",
      "sjje":4102.77,
      "sjrs":2.49
    },
    {
      "qx":"平乡",
      "sjje":1151.27,
      "sjrs":1.15
    },
    {
      "qx":"广宗",
      "sjje":968.55,
      "sjrs":0.89
    },
    {
      "qx":"新河",
      "sjje":577.62,
      "sjrs":0.57
    },
    {
      "qx":"柏乡",
      "sjje":520.22,
      "sjrs":0.46
    },
    {
      "qx":"沙河",
      "sjje":2020.97,
      "sjrs":1.81
    },
    {
      "qx":"清河",
      "sjje":1321.81,
      "sjrs":1.34
    },
    {
      "qx":"襄都区",
      "sjje":5633.81,
      "sjrs":4.50
    },
    {
      "qx":"隆尧",
      "sjje":1633.26,
      "sjrs":2.40
    }
  ]
});
const jc_tsqkfx = Mock.mock({
  // "list|1": [
  //   {
  //     ts: "@integer(2000,5000)",
  //     wts: "@integer(2000,5000)"
  //   }
  // ]
  "retList":[
    {
      "wts":791,
      "ts":704
    }
  ]
});
const monthList = [
  "一月",
  "二月",
  "三月",
  "四月",
  "五月",
  "六月",
  "七月",
  "八月",
  "九月",
  "十月",
  "十一月",
  "十二月"
];
const jc_xhrqfx = Mock.mock({
  // "list|48": [
  //   {
  //     "id|+1": 0,
  //     month: function() {
  //       return monthList[this.id % 12];
  //     },
  //     yylx: function() {
  //       if (this.id < 12) {
  //         return "原因1";
  //       } else if (this.id < 24) {
  //         return "原因2";
  //       } else if (this.id < 36) {
  //         return "原因3";
  //       } else {
  //         return "原因4";
  //       }
  //     },
  //     sl: "@integer(200,500)",
  //     pct: "@float(0,100,1,1)"
  //   }
  // ]
  "retList":[
    {
      "yy":"死亡",
      "rs":39,
      "xhny":"2023-05"
    },
    {
      "yy":"调离本市",
      "rs":137,
      "xhny":"2023-05"
    },
    {
      "yy":"解除劳动关系",
      "rs":586,
      "xhny":"2023-05"
    },
    {
      "yy":"离退休",
      "rs":953,
      "xhny":"2023-05"
    },
    {
      "yy":"死亡",
      "rs":25,
      "xhny":"2023-06"
    },
    {
      "yy":"调离本市",
      "rs":143,
      "xhny":"2023-06"
    },
    {
      "yy":"解除劳动关系",
      "rs":533,
      "xhny":"2023-06"
    },
    {
      "yy":"离退休",
      "rs":832,
      "xhny":"2023-06"
    },
    {
      "yy":"死亡",
      "rs":62,
      "xhny":"2023-07"
    },
    {
      "yy":"调离本市",
      "rs":218,
      "xhny":"2023-07"
    },
    {
      "yy":"解除劳动关系",
      "rs":1046,
      "xhny":"2023-07"
    },
    {
      "yy":"离退休",
      "rs":1212,
      "xhny":"2023-07"
    },
    {
      "yy":"死亡",
      "rs":80,
      "xhny":"2023-08"
    },
    {
      "yy":"调离本市",
      "rs":229,
      "xhny":"2023-08"
    },
    {
      "yy":"离退休",
      "rs":1304,
      "xhny":"2023-08"
    },
    {
      "yy":"解除劳动关系",
      "rs":1499,
      "xhny":"2023-08"
    },
    {
      "yy":"死亡",
      "rs":57,
      "xhny":"2023-09"
    },
    {
      "yy":"调离本市",
      "rs":134,
      "xhny":"2023-09"
    },
    {
      "yy":"离退休",
      "rs":785,
      "xhny":"2023-09"
    },
    {
      "yy":"解除劳动关系",
      "rs":960,
      "xhny":"2023-09"
    },
    {
      "yy":"死亡",
      "rs":34,
      "xhny":"2023-10"
    },
    {
      "yy":"调离本市",
      "rs":157,
      "xhny":"2023-10"
    },
    {
      "yy":"离退休",
      "rs":839,
      "xhny":"2023-10"
    },
    {
      "yy":"解除劳动关系",
      "rs":1196,
      "xhny":"2023-10"
    },
    {
      "yy":"死亡",
      "rs":36,
      "xhny":"2023-11"
    },
    {
      "yy":"调离本市",
      "rs":138,
      "xhny":"2023-11"
    },
    {
      "yy":"离退休",
      "rs":853,
      "xhny":"2023-11"
    },
    {
      "yy":"解除劳动关系",
      "rs":1468,
      "xhny":"2023-11"
    },
    {
      "yy":"死亡",
      "rs":25,
      "xhny":"2023-12"
    },
    {
      "yy":"调离本市",
      "rs":156,
      "xhny":"2023-12"
    },
    {
      "yy":"离退休",
      "rs":695,
      "xhny":"2023-12"
    },
    {
      "yy":"解除劳动关系",
      "rs":920,
      "xhny":"2023-12"
    },
    {
      "yy":"死亡",
      "rs":35,
      "xhny":"2024-01"
    },
    {
      "yy":"调离本市",
      "rs":173,
      "xhny":"2024-01"
    },
    {
      "yy":"离退休",
      "rs":825,
      "xhny":"2024-01"
    },
    {
      "yy":"解除劳动关系",
      "rs":1112,
      "xhny":"2024-01"
    },
    {
      "yy":"死亡",
      "rs":17,
      "xhny":"2024-02"
    },
    {
      "yy":"调离本市",
      "rs":136,
      "xhny":"2024-02"
    },
    {
      "yy":"离退休",
      "rs":457,
      "xhny":"2024-02"
    },
    {
      "yy":"解除劳动关系",
      "rs":860,
      "xhny":"2024-02"
    },
    {
      "yy":"死亡",
      "rs":38,
      "xhny":"2024-03"
    },
    {
      "yy":"调离本市",
      "rs":193,
      "xhny":"2024-03"
    },
    {
      "yy":"离退休",
      "rs":758,
      "xhny":"2024-03"
    },
    {
      "yy":"解除劳动关系",
      "rs":1127,
      "xhny":"2024-03"
    },
    {
      "yy":"死亡",
      "rs":20,
      "xhny":"2024-04"
    },
    {
      "yy":"调离本市",
      "rs":172,
      "xhny":"2024-04"
    },
    {
      "yy":"离退休",
      "rs":722,
      "xhny":"2024-04"
    },
    {
      "yy":"解除劳动关系",
      "rs":1076,
      "xhny":"2024-04"
    }
  ]
});
const jc_tjfx_dw = Mock.mock({
  // "retList|5": [
  //   {
  //     "lb|+1": ["3个月内", "3-6月", "6-12月", "12-24月", "2年以上"],
  //     sl: "@integer(1000,5000)"
  //   }
  // ]
  "retList": [
    {
      "lb": "3个月以内",
      "sl": 477
    },
    {
      "lb": "3-6个月",
      "sl": 338
    },
    {
      "lb": "6-12个月",
      "sl": 175
    },
    {
      "lb": "1-2年",
      "sl": 121
    },
    {
      "lb": "2年以上",
      "sl": 725
    }
  ]
});
const jc_tjfx_dh = Mock.mock({
  // "retList|5": [
  //   {
  //     "lb|+1": ["3个月内", "3-6月", "6-12月", "12-24月", "2年以上"],
  //     sl: "@integer(1000,5000)"
  //   }
  // ]
  "retList":[
    {
      "seqno":1,
      "lb":"1-3月",
      "sl":32095
    },
    {
      "seqno":2,
      "lb":"3-6月",
      "sl":3741
    },
    {
      "seqno":3,
      "lb":"6-12月",
      "sl":2295
    },
    {
      "seqno":4,
      "lb":"12-24月",
      "sl":959
    },
    {
      "seqno":5,
      "lb":"2年以上",
      "sl":2573
    }
  ]
});
const jc_khyxhfx = Mock.mock({
  // "retList|12": [
  //   {
  //     "ny|+1": [
  //       "2022年4月",
  //       "2022年5月",
  //       "2022年6月",
  //       "2022年7月",
  //       "2022年8月",
  //       "2022年9月",
  //       "2022年10月",
  //       "2022年11月",
  //       "2022年12月",
  //       "2023年1月",
  //       "2023年2月",
  //       "2023年3月"
  //     ],
  //     khrs: "@integer(0,600)",
  //     xhrs: "@integer(0,200)",
  //     jzrs: "@integer(-200,400)"
  //   }
  // ]
  "retList":[
    {
      "jzrs":997,
      "xhrs":1691,
      "khny":"2023-05",
      "khrs":2688
    },
    {
      "jzrs":1149,
      "xhrs":1504,
      "khny":"2023-06",
      "khrs":2653
    },
    {
      "jzrs":755,
      "xhrs":2490,
      "khny":"2023-07",
      "khrs":3245
    },
    {
      "jzrs":66,
      "xhrs":3048,
      "khny":"2023-08",
      "khrs":3114
    },
    {
      "jzrs":1137,
      "xhrs":1893,
      "khny":"2023-09",
      "khrs":3030
    },
    {
      "jzrs":1240,
      "xhrs":2163,
      "khny":"2023-10",
      "khrs":3403
    },
    {
      "jzrs":951,
      "xhrs":2456,
      "khny":"2023-11",
      "khrs":3407
    },
    {
      "jzrs":1122,
      "xhrs":1745,
      "khny":"2023-12",
      "khrs":2867
    },
    {
      "jzrs":3217,
      "xhrs":2090,
      "khny":"2024-01",
      "khrs":5307
    },
    {
      "jzrs":704,
      "xhrs":1447,
      "khny":"2024-02",
      "khrs":2151
    },
    {
      "jzrs":116,
      "xhrs":2070,
      "khny":"2024-03",
      "khrs":2186
    },
    {
      "jzrs":739,
      "xhrs":1933,
      "khny":"2024-04",
      "khrs":2672
    }
  ]
});
const nxList2 = ["16-30岁", "31-40岁", "41-50岁", "50岁以上"];
const jc_jcnldfx = Mock.mock({
  // "retList|8": [
  //   {
  //     "id|+1": 0,
  //     nx: function() {
  //       return nxList2[this.id % 2];
  //     },
  //     xb: function() {
  //       if (this.id < 4) {
  //         return "女";
  //       } else {
  //         return "男";
  //       }
  //     },
  //     rs: "@integer(30000,80000)"
  //   }
  // ]
  "retList":[
    {
      "rs":39233,
      "nld":"16-30岁",
      "xb":"2"
    },
    {
      "rs":99494,
      "nld":"31-40岁",
      "xb":"2"
    },
    {
      "rs":74364,
      "nld":"41-50岁",
      "xb":"2"
    },
    {
      "rs":97720,
      "nld":"51岁以上",
      "xb":"2"
    },
    {
      "rs":45884,
      "nld":"16-30岁",
      "xb":"1"
    },
    {
      "rs":111808,
      "nld":"31-40岁",
      "xb":"1"
    },
    {
      "rs":82486,
      "nld":"41-50岁",
      "xb":"1"
    },
    {
      "rs":199255,
      "nld":"51岁以上",
      "xb":"1"
    }
  ]
});
module.exports = [
  {
    id: "jc_kb",
    value: jc_kb
  },
  {
    id: "jc_sjzhzsfx",
    value: jc_sjzhzsfx
  },
  {
    id: "jc_jcjsfx",
    value: jc_jcjsfx
  },
  {
    id: "jc_jcrqfx",
    value: jc_jcrqfx
  },
  {
    id: "jc_sjzhglfx",
    value: jc_sjzhglfx
  },
  {
    id: "jc_tsqkfx",
    value: jc_tsqkfx
  },
  {
    id: "jc_jcrqfxList",
    value: jc_jcrqfxList
  },
  {
    id: "jc_xhrqfx",
    value: jc_xhrqfx
  },
  {
    id: "jc_tjfx_dw",
    value: jc_tjfx_dw
  },
  {
    id: "jc_tjfx_dh",
    value: jc_tjfx_dh
  },
  {
    id: "jc_khyxhfx",
    value: jc_khyxhfx
  },
  {
    id: "jc_jcnldfx",
    value: jc_jcnldfx
  }
];
