const Mock = require("mockjs");
const tq_kb = Mock.mock({
  // "list|1": [
  //   {
  //     tqbs: "@integer(10000,100000)",
  //     tqbstb: "@float(-20,20,2,1)",
  //     tqje: "@float(100,10000,1,1)",
  //     tqjetb: "@float(-20,20,2,1)"
  //   }
  // ]
  "retList":[
    {
      "tqbstb":15.8,
      "tqbs":424,
      "tqjetb":-10.2,
      "tqje":560.72
    }
  ]
});
const tq_gftqfx = Mock.mock({
  // "list|5": [
  //   {
  //     "year|+1": ["2018年", "2019年", "2020年", "2021年", "2022年"],
  //     gftqbs: "@integer(10000,25000)",
  //     gftqpjnl: "@float(30,50,1,1)"
  //   }
  // ]
//     购房提取分析：
// 年份（一整年的数据）     笔数     金额(亿)
// 2019 11408 11.39
// 2020 9073 10.72
// 2021 7433 10.39
// 2022 4328 6.93
// 2023 6146 8.84
  "retList":[
    {
      "year":"2019年",
      "gftqje":11.39,
      "gftqbs":11408
    },
    {
      "year":"2020年",
      "gftqje":10.72,
      "gftqbs":9073
    },
    {
      "year":"2021年",
      "gftqje":10.39,
      "gftqbs":7433
    },
    {
      "year":"2022年",
      "gftqje":6.93,
      "gftqbs":4328
    },
    {
      "year":"2023年",
      "gftqje":8.84,
      "gftqbs":6146
    },
  ]
});
const tq_bndtqjezb = Mock.mock({
  // "list|1": [
  //   {
  //     gftq: "@float(100,10000,1,1)",
  //     gftq1: "@float(100,10000,1,1)",
  //     xhtq: "@float(100,10000,1,1)",
  //     qttq: "@float(100,10000,1,1)"
  //   }
  // ]
  "retList":[
    {
      "zftq":157.3,
      "xhtq":88.6,
      "qttq":157.3,
      "hdtq":722.8,
      "gftq":5267.5,
        "zc":66.5
    }
  ]
});
const tq_zfgxlfx = Mock.mock({
  // "list|3": [
  //   {
  //     id: "@id",
  //     "lx|+1": ["购建房提取", "租房提取", "其他提取"],
  //     sl: "@integer(5000, 10000)"
  //   }
  // ]
// 购建房提取（购房+建房） = 8.51%
// 还贷提取 = 49.37%
// 租房提取 = 4.86%
  "retList":[
      {

          name: "购建房提取",
          value: 248779
      },
      {
          name: "租房提取",
          value: 134866
      },
      {

          name: "还贷提取",
          value: 105677
      },
  ]
});
const tq_tqzsfxt = Mock.mock({
  // "list|60": [
  //   {
  //     id: "@id",
  //     "month|+1": [
  //       "1月",
  //       "2月",
  //       "3月",
  //       "4月",
  //       "5月",
  //       "6月",
  //       "7月",
  //       "8月",
  //       "9月",
  //       "10月",
  //       "11月",
  //       "12月"
  //     ],
  //     "year|+1": ["2018", "2019", "2020", "2021", "2022"],
  //     je: "@integer(500,2500)"
  //   }
  // ]
  "retList":[
    {
      "month":"01",
      "year":"2019",
      "je":16619.55
    },
    {
      "month":"02",
      "year":"2019",
      "je":9095.36
    },
    {
      "month":"03",
      "year":"2019",
      "je":16053.05
    },
    {
      "month":"04",
      "year":"2019",
      "je":14966.83
    },
    {
      "month":"05",
      "year":"2019",
      "je":13124.69
    },
    {
      "month":"06",
      "year":"2019",
      "je":11090.91
    },
    {
      "month":"07",
      "year":"2019",
      "je":33160.12
    },
    {
      "month":"08",
      "year":"2019",
      "je":16122.55
    },
    {
      "month":"09",
      "year":"2019",
      "je":15801.69
    },
    {
      "month":"10",
      "year":"2019",
      "je":15969.72
    },
    {
      "month":"11",
      "year":"2019",
      "je":15266.39
    },
    {
      "month":"12",
      "year":"2019",
      "je":13318.08
    },
    {
      "month":"01",
      "year":"2020",
      "je":11105.62
    },
    {
      "month":"02",
      "year":"2020",
      "je":2427.06
    },
    {
      "month":"03",
      "year":"2020",
      "je":12074.56
    },
    {
      "month":"04",
      "year":"2020",
      "je":19297.18
    },
    {
      "month":"05",
      "year":"2020",
      "je":15816.77
    },
    {
      "month":"06",
      "year":"2020",
      "je":17343.67
    },
    {
      "month":"07",
      "year":"2020",
      "je":36276.09
    },
    {
      "month":"08",
      "year":"2020",
      "je":17772.16
    },
    {
      "month":"09",
      "year":"2020",
      "je":18288.78
    },
    {
      "month":"10",
      "year":"2020",
      "je":16750.19
    },
    {
      "month":"11",
      "year":"2020",
      "je":17360.67
    },
    {
      "month":"12",
      "year":"2020",
      "je":20017.37
    },
    {
      "month":"01",
      "year":"2021",
      "je":11245.99
    },
    {
      "month":"02",
      "year":"2021",
      "je":11783.50
    },
    {
      "month":"03",
      "year":"2021",
      "je":20904.72
    },
    {
      "month":"04",
      "year":"2021",
      "je":18925.70
    },
    {
      "month":"05",
      "year":"2021",
      "je":16427.38
    },
    {
      "month":"06",
      "year":"2021",
      "je":16072.04
    },
    {
      "month":"07",
      "year":"2021",
      "je":32231.39
    },
    {
      "month":"08",
      "year":"2021",
      "je":18884.00
    },
    {
      "month":"09",
      "year":"2021",
      "je":17199.81
    },
    {
      "month":"10",
      "year":"2021",
      "je":13586.64
    },
    {
      "month":"11",
      "year":"2021",
      "je":20144.54
    },
    {
      "month":"12",
      "year":"2021",
      "je":18309.68
    },
    {
      "month":"01",
      "year":"2022",
      "je":20219.94
    },
    {
      "month":"02",
      "year":"2022",
      "je":16462.38
    },
    {
      "month":"03",
      "year":"2022",
      "je":20241.97
    },
    {
      "month":"04",
      "year":"2022",
      "je":15230.13
    },
    {
      "month":"05",
      "year":"2022",
      "je":17821.41
    },
    {
      "month":"06",
      "year":"2022",
      "je":19106.74
    },
    {
      "month":"07",
      "year":"2022",
      "je":35003.59
    },
    {
      "month":"08",
      "year":"2022",
      "je":22593.08
    },
    {
      "month":"09",
      "year":"2022",
      "je":22120.40
    },
    {
      "month":"10",
      "year":"2022",
      "je":18866.73
    },
    {
      "month":"11",
      "year":"2022",
      "je":12770.02
    },
    {
      "month":"12",
      "year":"2022",
      "je":17990.31
    },
    {
      "month":"01",
      "year":"2023",
      "je":27407.39
    },
    {
      "month":"02",
      "year":"2023",
      "je":27513.49
    },
    {
      "month":"03",
      "year":"2023",
      "je":29277.52
    },
    {
      "month":"04",
      "year":"2023",
      "je":26003.81
    },
    {
      "month":"05",
      "year":"2023",
      "je":27675.69
    },
    {
      "month":"06",
      "year":"2023",
      "je":24029.60
    },
    {
      "month":"07",
      "year":"2023",
      "je":42812.10
    },
    {
      "month":"08",
      "year":"2023",
      "je":34103.28
    },
    {
      "month":"09",
      "year":"2023",
      "je":27601.78
    },
    {
      "month":"10",
      "year":"2023",
      "je":28183.28
    },
    {
      "month":"11",
      "year":"2023",
      "je":27202.14
    },
    {
      "month":"12",
      "year":"2023",
      "je":25737.80
    }
  ]
});
const tq_ljtxnxrq = Mock.mock({
  // "list|6": [
  //   {
  //     id: "@id",
  //     "lx|+1": ["1年以下", "1~2年", "2~3年", "3~5年", "5~10年", "10年以上"],
  //     xb: "男",
  //     rs: "@integer(500,1250)"
  //   },
  //   {
  //     id: "@id",
  //     "lx|+1": ["1年以下", "1~2年", "2~3年", "3~5年", "5~10年", "10年以上"],
  //     xb: "女",
  //     rs: "@integer(500,1250)"
  //   }
  // ]
  "retList":[
    {
      "rs":300,
      "xb":"1",
      "lx":"1~3月"
    },
    {
      "rs":100,
      "xb":"2",
      "lx":"1~3月"
    },
    {
      "rs":550,
      "xb":"1",
      "lx":"4~6月"
    },
    {
      "rs":440,
      "xb":"2",
      "lx":"4~6月"
    },
    {
      "rs":624,
      "xb":"1",
      "lx":"7~9"
    },
    {
      "rs":350,
      "xb":"2",
      "lx":"7~9"
    },
    {
      "rs":820,
      "xb":"1",
      "lx":"10~12月"
    },
    {
      "rs":590,
      "xb":"2",
      "lx":"10~12月"
    },
  ]
});
const tq_tqyyfx = Mock.mock({
  // "list|5": [
  //   {
  //     "yylx|+1": ["构建房", "租房", "离退休", "转出", "其他"],
  //     je: "@integer(100,10000)"
  //   }
  // ]
  "retList":[
    {
      "yylx":"其他",
      "je":414415.20
    },
    {
      "yylx":"离退休",
      "je":424500.92
    },
    {
      "yylx":"租房",
      "je":51738.87
    },
    {
      "yylx":"购建房",
      "je":402833.93
    },
    {
      "yylx":"还贷提取",
      "je":704474.74
    }
  ]
});
const tq_zftqnlfx = Mock.mock({
  // "list|4": [
  //   {
  //     id: "@id",
  //     "lx|+1": ["16-30岁", "31-40岁", "41=50岁", "50岁以上"],
  //     bs: "@integer(30000,100000)",
  //     je: "@integer(100,1000)"
  //   }
  // ]
  "retList":[
    {
      "bs":33563,
      "je":15,
      "lx":"51岁以上"
    },
    {
      "bs":62814,
      "je":22,
      "lx":"41-50岁"
    },
    {
      "bs":54826,
      "je":28,
      "lx":"31-40岁"
    },
    {
      "bs":28569,
      "je":17,
      "lx":"16-30岁"
    }
  ]
});
module.exports = [
  {
    id: "tq_kb",
    value: tq_kb
  },
  {
    id: "tq_gftqfx",
    value: tq_gftqfx
  },
  {
    id: "tq_bndtqjezb",
    value: tq_bndtqjezb
  },
  {
    id: "tq_zfgxlfx",
    value: tq_zfgxlfx
  },
  {
    id: "tq_ljtxnxrq",
    value: tq_ljtxnxrq
  },
  {
    id: "tq_tqzsfxt",
    value: tq_tqzsfxt
  },
  {
    id: "tq_tqyyfx",
    value: tq_tqyyfx
  },
  {
    id: "tq_zftqnlfx",
    value: tq_zftqnlfx
  }
];
